[
  {
    "timestamp": "2025-04-18T23:40:44.274817",
    "video_id": "FUq9qRwrDrI",
    "video_title": "OpenAI Unveils Codeex: A Command-Line Coding Agent",
    "video_link": "https://www.youtube.com/watch?v=FUq9qRwrDrI",
    "summary": {
      "summary": "OpenAI introduces Codeex, a command-line coding agent for developers. Codeex can read/edit files and run commands to build features or complete apps. It supports multiple models, including GPT-4.1 and 03/04 mini. Live demos showcased Codeex adding dark mode to an existing codebase and recreating a photo booth app from a screenshot.",
      "tags": [
        "OpenAI",
        "Codeex",
        "coding agent",
        "GPT-4.1",
        "03",
        "04 mini",
        "command-line tool",
        "developers",
        "open source"
      ],
      "category": "Tech"
    },
    "source": "youtube"
  },
  {
    "timestamp": "2025-04-19T01:12:05.794093",
    "link": "https://www.analyticsvidhya.com/blog/2025/04/generative-ai-is-reshaping-human-connection/",
    "title": "AI: From Productivity to Emotional Support",
    "summary": {
      "summary": "In 2025, generative AI excels in emotional support, surpassing productivity tasks. Therapy and companionship rank #1, aiding mental wellness and personal growth. AI evolves into structured life coaches, assisting in goal alignment and introspection. Healthcare integrates AI for patient support and early condition identification, enhancing clinical workflows and telemedicine.",
      "tags": [
        "Generative AI",
        "Emotional Support",
        "Mental Wellness",
        "Therapy",
        "Technology",
        "Healthcare"
      ],
      "category": "Technology"
    },
    "source": "blog"
  },
  {
    "timestamp": "2025-04-19T17:06:09.039648",
    "link": "https://www.analyticsvidhya.com/blog/2025/04/mcp-client-server-using-langchain/",
    "title": "Build an MCP Client Server with LangChain",
    "summary": {
      "summary": "Learn to create an MCP client server using LangChain for AI agents. MCP enables LLMs to interact with external tools and data sources securely. This guide covers setup, server/client implementation, and real-world applications, offering a practical example for building intelligent AI applications.",
      "tags": [
        "MCP",
        "LangChain",
        "LLM",
        "AI Agents",
        "Client-Server Architecture"
      ],
      "category": "Tech"
    },
    "source": "blog"
  }
]