[
  {
    "timestamp": "2025-04-18T23:40:38.548807",
    "video_id": "BG4F3b5QpjM",
    "video_title": "Connect to Multiple MCP Servers with Langchain",
    "video_link": "https://www.youtube.com/watch?v=BG4F3b5QpjM",
    "summary": {
      "summary": "Learn how to connect to multiple MCP servers using Langchain and the MCP-Use library. The tutorial covers setting up a development environment with Cursor IDE, configuring MCP servers like Playwright, Airbnb, and DuckDuckGo, and building a chatbot that interacts with these services. The video also demonstrates how to use the MCP-Use library to connect to different LLMs.",
      "tags": [
        "MCP",
        "Langchain",
        "LLM",
        "Chatbot",
        "Python",
        "AI Agents"
      ],
      "category": "Tech"
    },
    "source": "youtube"
  },
  {
    "timestamp": "2025-04-18T23:40:41.178479",
    "video_id": "Gw20CwE5x-w",
    "video_title": "AI Accent Conversion Tool: Enhancing Communication or Erasing Identity?",
    "video_link": "https://www.youtube.com/watch?v=Gw20CwE5x-w",
    "summary": {
      "summary": "Crisp's AI tool converts Indian English accents to standard American English in real-time, with only 200ms latency. It preserves voice characteristics while modifying pronunciation and intonation. This tech aims to improve communication by softening accents, but raises questions about identity and cultural expression.",
      "tags": [
        "AI",
        "accent conversion",
        "Indian English",
        "American English",
        "voice technology",
        "communication"
      ],
      "category": "Tech"
    },
    "source": "youtube"
  },
  {
    "timestamp": "2025-04-19T01:12:03.246947",
    "link": "https://www.analyticsvidhya.com/blog/2025/04/generative-ai-is-reshaping-human-connection/",
    "title": "AI: From Productivity to Emotional Support",
    "summary": {
      "summary": "In 2025, generative AI excels in emotional support, surpassing productivity tasks. Therapy and companionship rank #1, aiding mental wellness and personal growth. AI evolves into structured life coaches, assisting in goal alignment and introspection. Healthcare integrates AI for patient support and early condition identification, enhancing clinical workflows and telemedicine.",
      "tags": [
        "Generative AI",
        "Emotional Support",
        "Mental Wellness",
        "Therapy",
        "Technology",
        "Healthcare"
      ],
      "category": "Technology"
    },
    "source": "blog"
  },
  {
    "timestamp": "2025-04-19T17:06:06.126620",
    "link": "https://www.analyticsvidhya.com/blog/2025/04/mcp-client-server-using-langchain/",
    "title": "Build an MCP Client Server with LangChain",
    "summary": {
      "summary": "Learn to create an MCP client server using LangChain for AI agents. MCP enables LLMs to interact with external tools and data sources securely. This guide covers setup, server/client implementation, and real-world applications, offering a practical example for building intelligent AI applications.",
      "tags": [
        "MCP",
        "LangChain",
        "LLM",
        "AI Agents",
        "Client-Server Architecture"
      ],
      "category": "Tech"
    },
    "source": "blog"
  }
]